45/data/attachments/664b396b6b3fea3a.txt

URL: http://www.advantageonlineshopping.com:80/accountservice/ws
SOAP request : 
<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountCreateRequest>
            <com:lastName>Ashok</com:lastName>
            <com:firstName>Kumar</com:firstName>
            <com:loginName>KYCvU</com:loginName>
            <com:countryId>India,in</com:countryId>
            <com:stateProvince>Assam</com:stateProvince>
            <com:cityName>Guwahati</com:cityName>
            <com:address>Odalbakra Street, Kahilipara</com:address>
            <com:zipcode>781034</com:zipcode>
            <com:phoneNumber>5782786697</com:phoneNumber>
            <com:email>KYCvU@email.com</com:email>
            <com:password>Tqfpx453</com:password>
            <com:accountType>USER</com:accountType>
            <com:allowOffersPromotion>true</com:allowOffersPromotion>
            <com:aobUser>false</com:aobUser>
        </com:AccountCreateRequest>
    </x:Body>
</x:Envelope>
SOAP Response: 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:AccountCreateResponse xmlns:ns2="com.advantage.online.store.accountservice">
            <ns2:StatusMessage>
                <ns2:success>true</ns2:success>
                <ns2:userId>571531951</ns2:userId>
                <ns2:reason>New user created successfully.</ns2:reason>
                <ns2:token/>
                <ns2:sessionId/>
            </ns2:StatusMessage>
        </ns2:AccountCreateResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
